{
  "_name_or_path": "dump/wavlm-Llama-3.2-1B",
  "architectures": [
    "SpeechEncoderDecoderModelLlama"
  ],
  "bosp_token_id": 128261,
  "bosr_token_id": 128265,
  "boss_token_id": 128263,
  "decoder": {
    "_attn_implementation_autoset": true,
    "_name_or_path": "/lustre/share/downloaded/models/meta-llama/Llama-3.2-1B",
    "add_cross_attention": true,
    "architectures": [
      "LlamaForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": 128000,
    "bosp_token_id": 128261,
    "bosr_token_id": 128265,
    "boss_token_id": 128263,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": 128001,
    "eosp_token_id": 128262,
    "eosr_token_id": 128266,
    "eoss_token_id": 128264,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "ignore_token_id": -100,
    "initializer_range": 0.02,
    "instruct": true,
    "intermediate_size": 8192,
    "is_decoder": true,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "length_penalty": 1.0,
    "max_length": 20,
    "max_position_embeddings": 131072,
    "min_length": 0,
    "mlp_bias": false,
    "model_type": "llama",
    "no_repeat_ngram_size": 0,
    "num_attention_heads": 32,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_hidden_layers": 16,
    "num_key_value_heads": 8,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": 128267,
    "prefix": null,
    "pretraining_tp": 1,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "rms_norm_eps": 1e-05,
    "rope_scaling": {
      "factor": 32.0,
      "high_freq_factor": 4.0,
      "low_freq_factor": 1.0,
      "original_max_position_embeddings": 8192,
      "rope_type": "llama3"
    },
    "rope_theta": 500000.0,
    "sc_token_id": 128256,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": "bfloat16",
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false,
    "use_cache": true,
    "vocab_size": 128268
  },
  "decoder_start_token_id": 128000,
  "encoder": {
    "_attn_implementation_autoset": true,
    "_name_or_path": "/lustre/users/gao/asr_ser/exp_wavlm",
    "activation_dropout": 0.0,
    "adapter_kernel_size": 3,
    "adapter_stride": 2,
    "add_adapter": true,
    "add_cross_attention": false,
    "apply_spec_augment": true,
    "architectures": [
      "Wav2Vec2ForCTCnCLS"
    ],
    "attention_dropout": 0.1,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": 1,
    "chunk_size_feed_forward": 0,
    "classifier_proj_size": 256,
    "codevector_dim": 768,
    "contrastive_logits_temperature": 0.1,
    "conv_bias": false,
    "conv_dim": [
      512,
      512,
      512,
      512,
      512,
      512,
      512
    ],
    "conv_kernel": [
      10,
      3,
      3,
      3,
      3,
      2,
      2
    ],
    "conv_stride": [
      5,
      2,
      2,
      2,
      2,
      2,
      2
    ],
    "cross_attention_hidden_size": null,
    "ctc_loss_reduction": "sum",
    "ctc_zero_infinity": false,
    "decoder_start_token_id": null,
    "diversity_loss_weight": 0.1,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "do_stable_layer_norm": true,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": 2,
    "exponential_decay_length_penalty": null,
    "feat_extract_activation": "gelu",
    "feat_extract_dropout": 0.0,
    "feat_extract_norm": "layer",
    "feat_proj_dropout": 0.0,
    "feat_quantizer_dropout": 0.0,
    "final_dropout": 0.0,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout": 0.1,
    "hidden_size": 1024,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layer_norm_eps": 1e-05,
    "layerdrop": 0.0,
    "length_penalty": 1.0,
    "mask_channel_length": 10,
    "mask_channel_min_space": 1,
    "mask_channel_other": 0.0,
    "mask_channel_prob": 0.0,
    "mask_channel_selection": "static",
    "mask_feature_length": 10,
    "mask_feature_min_masks": 0,
    "mask_feature_prob": 0.0,
    "mask_time_length": 10,
    "mask_time_min_masks": 2,
    "mask_time_min_space": 1,
    "mask_time_other": 0.0,
    "mask_time_prob": 0.1,
    "mask_time_selection": "static",
    "max_bucket_distance": 800,
    "max_length": 20,
    "min_length": 0,
    "model_type": "wavlm",
    "no_repeat_ngram_size": 0,
    "num_adapter_layers": 3,
    "num_attention_heads": 16,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_buckets": 320,
    "num_codevector_groups": 2,
    "num_codevectors_per_group": 320,
    "num_conv_pos_embedding_groups": 16,
    "num_conv_pos_embeddings": 128,
    "num_ctc_classes": 80,
    "num_feat_extract_layers": 7,
    "num_hidden_layers": 24,
    "num_negatives": 100,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_size": 1024,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": 0,
    "prefix": null,
    "problem_type": null,
    "proj_codevector_dim": 768,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "replace_prob": 0.5,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "tdnn_dilation": [
      1,
      2,
      3,
      1,
      1
    ],
    "tdnn_dim": [
      512,
      512,
      512,
      512,
      1500
    ],
    "tdnn_kernel": [
      5,
      3,
      3,
      1,
      1
    ],
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": "Wav2Vec2CTCTokenizer",
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": "float32",
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false,
    "use_weighted_layer_sum": false,
    "vocab_size": 32,
    "xvector_output_dim": 512
  },
  "eos_token_id": 128001,
  "eosp_token_id": 128262,
  "eosr_token_id": 128266,
  "eoss_token_id": 128264,
  "ignore_token_id": -100,
  "instruct": true,
  "is_encoder_decoder": true,
  "max_length": null,
  "model_type": "speech-encoder-decoder",
  "pad_token_id": 128267,
  "processor_class": "Wav2Vec2Processor",
  "sc_token_id": 128256,
  "talker_ctc": true,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.47.0",
  "use_cache": true
}
