{
  "additional_special_tokens": [
    "<sc>",
    "<neutral>",
    "<sadness>",
    "<anger>",
    "<happiness>",
    "<bos_prompt>",
    "<eos_prompt>",
    "<bos_speech>",
    "<eos_speech>",
    "<bos_response>",
    "<eos_response>"
  ],
  "bos_token": {
    "content": "<|begin_of_text|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "eos_token": {
    "content": "<|end_of_text|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<pad>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
